IDENTIFICATION DIVISION.
PROGRAM-ID. GLOBAL-BANK.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 TRANSACTION-CODE PIC X(2).
    01 AMOUNT PIC 9(10).
    01 CUSTOMER-ID PIC X(10).

PROCEDURE DIVISION.
START-OF-PROCESSING.
    DISPLAY 'WELCOME TO THE GLOBAL BANK'.
    GET TRANSACTION-CODE FROM KEYBOARD.
    IF TRANSACTION-CODE = '1'
        PROCESS-CREDIT
    ELSE IF TRANSACTION-CODE = '2'
        PROCESS-DEBIT
    ELSE
        DISPLAY 'INVALID TRANSACTION CODE'.
    END-IF.

PROCESS-CREDIT.
    READ CUSTOMER-ID FROM KEYBOARD.
    ADD AMOUNT TO CUSTOMER-BALANCE.
    DISPLAY 'CREDIT TRANSACTION SUCCESSFUL'.

PROCESS-DEBIT.
    READ CUSTOMER-ID FROM KEYBOARD.
    SUBTRACT AMOUNT FROM CUSTOMER-BALANCE.
    DISPLAY 'DEBIT TRANSACTION SUCCESSFUL'.
